In [71]:
import pandas as pd 
from sqlalchemy import create_engine
import more_itertools
from sqlalchemy import text
import numpy as np

In [52]:
#!pip install more-itertools

In [72]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [74]:
def executeSQL(qry):
    result = engine.execute(qry)
    for i in result:
        print(i)

In [75]:
 


def eSQL(qry):
    output = []
    result = engine.execute(qry)
    for i in result:
        output.append(i)
    df = pd.DataFrame(np.array(output))
    print(df)

In [76]:
df_location = pd.read_csv('taxi+_zone_lookup.csv')
df_green = pd.read_csv('green_tripdata_2019-01.csv', iterator=True, chunksize=200000)

In [77]:
number_of_t = more_itertools.ilen(df_green)

In [78]:
df = pd.read_csv('green_tripdata_2019-01.csv')
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [79]:
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,NaN,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,NaN,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,NaN,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,NaN,0.3,19.30,2,1,NaN

In [60]:
df_location.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [80]:
from time import time
number_of_t

4

In [81]:
df_green_iter = pd.read_csv('green_tripdata_2019-01.csv', iterator=True, chunksize=200000)

In [82]:
for n in range(number_of_t):
    print(f"{n} batch" )
    t_start = time()
    df = next(df_green_iter)
    df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
    df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
    df.to_sql(name='green_taxi_data', con=engine, if_exists='append')
    t_end = time()
    print('inserted another chunk, took %.3f second' % (t_end - t_start))

0 batch
inserted another chunk, took 17.859 second
1 batch
inserted another chunk, took 17.354 second
2 batch
inserted another chunk, took 19.529 second
3 batch
inserted another chunk, took 3.117 second

In [28]:
# while True:
#     t_start = time()
#     df = next(df_green)
#     df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
#     df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
#     df.to_sql(name='green_taxi_data', con=engine, if_exists='append')
#     t_end = time()
#     print('inserted another chunk, took %.3f second' % (t_end - t_start))

In [83]:
df_location.to_sql('location_data', engine)

265

In [ ]:

# ## Question 3. Count records 

# How many taxi trips were totally made on January 15?

# Tip: started and finished on 2019-01-15. 

# Remember that `lpep_pickup_datetime` and `lpep_dropoff_datetime` columns are in the format timestamp (date and hour+min+sec) and not in date.

# - 20689
# - 20530 ******
# - 17630
# - 21090

In [66]:
executeSQL('''    
SELECT COUNT(*) FROM (SELECT  * FROM green_taxi_data
WHERE  lpep_pickup_datetime::DATE = '2019-01-15' AND lpep_pickup_datetime::DATE  = lpep_dropoff_datetime::DATE)
AS countDATA
''')

(20530,)

In [ ]:

# ## Question 4. Largest trip for each day

# Which was the day with the largest trip distance
# Use the pick up time for your calculations.

# - 2019-01-18
# - 2019-01-28
# - 2019-01-15
# - 2019-01-10

In [84]:
executeSQL('''

SELECT lpep_pickup_datetime::DATE  , "trip_distance" FROM green_taxi_data
ORDER BY "trip_distance"  DESC LIMIT 1

''')

(datetime.date(2019, 1, 15), 117.99)

In [ ]:
## Question 5. The number of passengers

In 2019-01-01 how many trips had 2 and 3 passengers?
 
- 2: 1282 ; 3: 266
- 2: 1532 ; 3: 126
- 2: 1282 ; 3: 254 ****
- 2: 1282 ; 3: 274

In [67]:
executeSQL('''  SELECT  COUNT(*) FROM green_taxi_data
WHERE passenger_count = 3 AND lpep_pickup_datetime::DATE = '2019-01-01'
''')

(254,)

In [68]:
executeSQL(''' SELECT  COUNT(*) FROM green_taxi_data
WHERE passenger_count = 2 AND lpep_pickup_datetime::DATE = '2019-01-01'
''')

(1282,)

In [ ]:
# ## Question 6. Largest tip

# For the passengers picked up in the Astoria Zone which was the drop off zone that had the largest tip?
# We want the name of the zone, not the id.

# Note: it's not a typo, it's `tip` , not `trip`

# - Central Park
# - Jamaica
# - South Ozone Park
# - Long Island City/Queens Plaza **********

In [ ]:



SELECT COUNT(*) FROM (SELECT  * FROM green_taxi_data
WHERE  lpep_pickup_datetime::DATE = '2019-01-15' AND lpep_pickup_datetime::DATE  = lpep_dropoff_datetime::DATE)
AS countDATA


SELECT  COUNT(*) FROM green_taxi_data
WHERE passenger_count = 3 AND lpep_pickup_datetime::DATE = '2019-01-01'

SELECT  COUNT(*) FROM green_taxi_data
WHERE passenger_count = 2 AND lpep_pickup_datetime::DATE = '2019-01-01'
        
        

SELECT "LocationID", "DOLocationID" ,"PULocationID", "Zone", "tip_amount" FROM green_taxi_data
INNER JOIN location_data ON green_taxi_data."PULocationID" = location_data."LocationID"
WHERE "Zone" = 'Astoria' ORDER BY tip_amount DESC

SELECT * FROM location_data
WHERE "LocationID" = 146




SELECT lpep_pickup_datetime::DATE  , "trip_distance" FROM green_taxi_data
ORDER BY "trip_distance"  DESC LIMIT 1